const resultOptions = {
    YES: 'РІШЕННЯ ПРИЙНЯТЕ',
    NO: 'РІШЕННЯ НЕ ПРИЙНЯТЕ'
}

const voteOptions = {
    YES: 'За',
    NO: 'Проти',
    NO_VOTE: 'Утримався',
    DID_NOT_VOTE: 'Не голосував',
    NO_SHOW: 'Відсутній'
}

const voteOptionsEmoji = {
    YES: '🙋‍♂️',
    NO: '🙅‍♀️',
    NO_VOTE: '🤷',
    DID_NOT_VOTE: '👤',
    NO_SHOW: '🥷'
}

const voteToCountMap = {
    YES: 'YESCnt',
    NO: 'NOCnt',
    NO_VOTE: 'UTRCnt',
    DID_NOT_VOTE: 'NGCnt',
    NO_SHOW: 'ABSCnt'
}

let readableThemeMap = {
    LAND: 'Земельні ділянки',
    COMMUNE: 'Комунальні підприємства',
    SOCIAL: 'Соціальні теми',
    CITY: 'Міські теми та проєкти',
    EDUCATION: 'Освіта',
    ORG: 'Технічна робота',
    OTHER: 'Інші теми'
}

let themeToCategoryMap = {
    LAND: [
        'Зміна призначення земельної ділянки',
        'Виплата громадянину за земельну ділянку',
        'Продаж земельної ділянки',
        'Відмова в оренді земельної ділянки',
        'Постійне користування земельної ділянки',
        'Приватизація земельної ділянки',
        'Дозвіл на розроблення проєкту землеустрою',
        'Дозвіл на оцінку земельної ділянки',
        'Оренда земельної ділянки',
        'Розірвання договору оренди земельної ділянки',
        'Поновлення договору оренди земельної ділянки',
        'Відмова в поновленні аренди земельної ділянки'
    ],
    COMMUNE: [
        'Прийняття до комунальної власності',
        'Реорганізація комунального підприємства',
        'Створення комунальної установи'
    ],
    SOCIAL: [
        'Надання пільг',
        'Дозвіл на створення органу самоорганізації населення'
    ],
    CITY: [
        'Згода на реалізацію проєкту',
        'Створення комісії',
        'Благоустрій',
        'Міські цільові програми'
    ],
    EDUCATION: [
      'Зміна типу або найменування навчального закладу'
    ],
    ORG: [ 
        'Порядок денний: прийняття, зміни, тощо',
        'Внесення змін у попередні рішення',
        'Надання слова',
        'Підтрика депутатських запитів',
        'Зверняння КМДА до державних стуктур',
        'Cкладання депутатських повноважень',
        'Правку депутата'
    ],
    OTHER: [
        'Перейменування',
        'Інша категорія'
    ]
}